cbt-200-loadtest.yml
config:
  target: "https://bimbel.geniusedu.my.id"
  phases:
    # Phase 1: Warm-up (30s, ramp 5→30 users/sec)
    - duration: 30
      arrivalRate: 5
      rampTo: 30
      name: "Phase 1 — Warm-up (5→30 siswa/detik)"

    # Phase 2: Normal load (60s, 50 users/sec)
    - duration: 60
      arrivalRate: 50
      name: "Phase 2 — Normal load (50 siswa/detik)"

    # Phase 3: Target capacity (60s, 100 users/sec)
    - duration: 60
      arrivalRate: 100
      name: "Phase 3 — Target 200 concurrent (100 siswa/detik)"

    # Phase 4: Stress test (30s, 150 users/sec)
    - duration: 30
      arrivalRate: 150
      name: "Phase 4 — Stress test (150 siswa/detik)"

  defaults:
    headers:
      User-Agent: "Artillery-CBT-LoadTest/1.0"

  plugins:
    expect: {}

scenarios:
  # Skenario 1: Siswa browsing halaman utama (30% traffic)
  - name: "Browsing Landing Page"
    weight: 30
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
      - think: 2
      - get:
          url: "/login"
          expect:
            - statusCode: 200

  # Skenario 2: Siswa login + akses dashboard (40% traffic)
  - name: "Login + Dashboard Access"
    weight: 40
    flow:
      - get:
          url: "/login"
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/"
          expect:
            - statusCode: 200
      - think: 2
      - get:
          url: "/login"
          expect:
            - statusCode: 200

  # Skenario 3: Simulasi beban CBT — akses halaman publik (30% traffic)
  - name: "CBT-like Load Simulation"
    weight: 30
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
      - think: 1
      - get:
          url: "/login"
          expect:
            - statusCode: 200
      - think: 3
      - get:
          url: "/daftar/step1"
          expect:
            - statusCode: 200
      - think: 2
      - get:
          url: "/"
          expect:
            - statusCode: 200