load-test.yml
config:
  target: "https://bimbel.geniusedu.my.id"
  tls:
    rejectUnauthorized: false
  http:
    timeout: 10
  defaults:
    headers:
      User-Agent: "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36"
  phases:
    - duration: 60
      arrivalRate: 2
      name: "Ujian Nyata (120 Siswa per menit)"
scenarios:
  - name: "Siswa Buka Web"
    flow:
      - get:
          url: "/"
      - think: 3
      - get:
          url: "/login"
      - think: 2
      - get:
          url: "/daftar/step1"