vps-load-test.yml
config:
  target: "https://bimbel.geniusedu.my.id"
  phases:
    - duration: 60
      arrivalRate: 2
      name: "Ujian VPS (120 Siswa per menit)"
scenarios:
  - name: "Siswa Buka Web"
    flow:
      - get:
          url: "/"
      - think: 3
      - get:
          url: "/login"
      - think: 2
      - get:
          url: "/daftar/step1"